Repository: PikaOS-Linux/pkg-mintupdate
Catalog: mintupdate/po/mintupdate-*.po
Languages: fi

source: Show Descriptions
fi: Näytä kuvaukset

source: _Help
fi: _Ohje

source: Welcome Screen
fi: Aloitusnäkymä

source: Keyboard Shortcuts
fi: Pikanäppäimet

source: Contents
fi: Sisältö

source: About
fi: Tietoja

source: Cannot Proceed
fi: Ei voida jatkaa

source: Another process is currently using the package management system. Please wait for it to finish and then try again.
fi: Toinen prosessi käyttää parhaillaan paketinhallintajärjestelmää. Odota, kunnes se päättyy, ja yritä sitten uudelleen.

source: Yes
fi: Kyllä

source: No
fi: Ei

source: No updates selected
fi: Päivityksiä ei valittu

source: Welcome to the Update Manager
fi: Tervetuloa päivitysten hallintaan

source: Most recent change
fi: Viimeisin muutos

source: Description
fi: Kuvaus

source: This update affects the following installed package:
fi: Tämä päivitys vaikuttaa seuraavaan asennettuun pakettiin:

source: Total size:
fi: Koko yhteensä:

source: Ignore the current update for this package
fi: Ohita tämän paketin nykyinen päivitys

source: Ignore all future updates for this package
fi: Ohita kaikki tämän paketin tulevat päivitykset

source: Date
fi: Päivämäärä

source: Update
fi: Päivitä

source: package
fi: paketti

source: Options
fi: Asetukset

source: Blacklist
fi: Mustalista

source: Automation
fi: Automatisointi

source: Interface
fi: Käyttöliittymä

source: Hide the update manager after applying updates
fi: Piilota päivitysten hallinta, kun päivitykset on toteutettu

source: Only show a tray icon when updates are available or in case of errors
fi: Näytä kuvake ilmoitusalueella vain, kun päivityksiä on saatavilla tai on tapahtunut virhe

source: Auto-refresh
fi: Virkistä automaattisesti

source: Refresh the list of updates automatically
fi: Virkistä päivitysluettelo automaattisesti

source: days
fi: päivää

source: hours
fi: tuntia

source: minutes
fi: minuuttia

source: First, refresh the list of updates after:
fi: Ensiksi, päivitä lista päivityksien jälkeen:

source: Then, refresh the list of updates every:
fi: Sitten, päivitä lista joka:

source: Note: The list only gets refreshed while the Update Manager window is closed (system tray mode).
fi: Huomautus: Lista päivittyy vain, kun päivitysten hallinnan ikkuna on suljettu (alavalikon tila).

source: Notifications
fi: Ilmoitukset

source: Only show notifications for security and kernel updates
fi: Näytä ilmoitukset vain tietoturva ja kernel päivityksistä

source: Show a notification if an update has been available for (in logged-in days):
fi: Näytä ilmoitus, jos päivitys on ollut saatavilla kirjautuneena (päivää):

source: Show a notification if an update is older than (in days):
fi: Näytä ilmoitus, jos päivitys on vanhempi kuin (päivää):

source: Don't show notifications if an update was applied in the last (in days):
fi: Älä näytä ilmoitusta, jos uusi päivitys lisätty saataville (päivää):

source: Ignored Updates
fi: Sivuutetut päivitykset

source: Package Updates
fi: Pakettien päivitykset

source: Performed as root on a daily basis
fi: Suoritetaan pääkäyttäjänä päivittäin

source: Apply updates automatically
fi: Toteuta päivitykset automaattisesti

source: Export blacklist to /etc/mintupdate.blacklist
fi: Vie mustalista kohteeseen /etc/mintupdate.blacklist

source: Click this button for automatic updates to use your current blacklist.
fi: Paina tätä painiketta nykyisen mustalistasi päivittämiseksi automaattisesti.

source: Update Cinnamon spices automatically
fi: Päivitä Cinnamon spices automaattisesti

source: Update flatpaks automatically
fi: Päivitä flatpak automaattisesti

source: Other Updates
fi: Muut päivitykset

source: Performed when you log in
fi: Suoritetaan, kun kirjaudut sisään

source: Automatic Maintenance
fi: Automaattinen ylläpito

source: Performed as root on a weekly basis
fi: Suoritetaan pääkäyttäjänä viikoittain

source: Remove obsolete kernels and dependencies
fi: Poista käyttämättömät kernelit ja riippuvuudet

source: This option always leaves at least one older kernel installed and never removes manually installed kernels.
fi: Tämä valinta jättää aina vähintään yhden vanhemman kernelin asennetuksi, eikä ikinä poista käsin asennettuja kerneleitä.

source: Please specify the source package name of the update to ignore (wildcards are supported) and optionally the version:
fi: Määritä päivityksessä huomiotta jätettävän lähdekoodipaketin nimi (yleismerkit ovat tuettuja) ja valinnaisesti versio:

source: Ignore an Update
fi: Sivuuta päivitys

source: Name:
fi: Nimi:

source: Version:
fi: Versio:

source: (optional)
fi: (valinnainen)

source: System Upgrade
fi: Järjestelmän päivitys

source: Introduction
fi: Esittely

source: Your system is missing critical components. A package corresponding to your edition of Linux Mint should provide the virtual package 'mint-info' and the file /etc/linuxmint/info.
fi: Järjestelmästäsi puuttuu kriittisiä komponentteja. Käyttämääsi Linux Mint -julkaisua vastaavan paketin tulisi tarjota virtuaalipaketti "mint-info" ja tiedosto /etc/linuxmint/info.

source: No upgrades were found.
fi: Päivityksiä ei löytynyt.

source: A new version of Linux Mint is available!
fi: Linux Mintin uusi versio on saatavilla!

source: An upgrade was found but it is not available yet for the %s edition.
fi: Päivitys löytyi, mutta se ei vielä ole saatavilla %s-julkaisulle.

source: Release notes
fi: Julkaisutiedot

source: Please read the release notes before upgrading. They explain all the known issues, workarounds and solutions associated with the new version.
fi: Ole hyvä ja lue julkaisutiedot ennen päivitystä. Ne kertovat sinulle kaikki tunnetut ongelmat, kiertotiet ja ratkaisut liittyen uuteen versioon.

source: Release notes for %s
fi: Julkaisutiedot %slle

source: Click on the link to open the release notes.
fi: Klikkaa linkkiä avataksesi julkaisutiedot.

source: New features
fi: Uusia ominaisuuksia

source: Please look at the new features introduced in the new version.
fi: Ole hyvä ja tutustu uudessa versiossa esiteltyihin ominaisuuksiin.

source: New features in %s
fi: Uusia ominaisuuksia %s-julkaisussa

source: Click on the link to browse the new features.
fi: Klikkaa linkkiä selataksesi uusia ominaisuuksia.

source: Requirements
fi: Vaatimukset

source: The package %s needs to be installed before upgrading.
fi: Paketti %s tulee asentaa ennen päivitystä.

source: Install %s
fi: Asenna %s

source: Click on the button to install the missing package.
fi: Klikkaa nappia asentaaksesi puuttuvan paketin.

source: New releases provide bug fixes and new features but they also sometimes introduce new issues. Upgrading always represents a risk. Your data is safe but new issues can potentially affect your operating system.
fi: Uudet julkaisut tuovat korjauksia ongelmiin ja uusia ominaisuuksia, mutta ne voivat joskus johtaa uusiin ongelmiin. Päivittämisessä on aina riskinsä. Tiedostosi ovat turvassa, mutta uudet ongelmat voivat potentiaalisesti vaikuttaa käyttöjärjestelmääsi.

source: I understand the risk. I want to upgrade to %s.
fi: Ymmärrän riskit. Haluan päivittää %s-julkaisuun.

source: Summary
fi: Yhteenveto

source: Your operating system was successfully upgraded. Please reboot your computer for all changes to take effect.
fi: Käyttöjärjestelmäsi päivitettiin onnistuneesti. Ole hyvä ja käynnistä tietokoneesi uudelleen, jotta muutokset tulevat käyttöön.

source: The upgrade did not succeed. Make sure you are connected to the Internet and try to upgrade again.
fi: Päivitys ei onnistunut. Tarkista internet-yhteytesi ja yritä päivittää uudelleen.

source: Show and install available updates
fi: Näytä ja asenna saatavilla olevat päivitykset

source: The following spices were automatically updated:
fi: Seuraavat spices-ohjelmat päivitettiin automaattisesti:

source: Cinnamon was restarted
fi: Cinnamon käynnistettiin uudelleen

source: Close
fi: Sulje

source: Process ID:
fi: Prosessin ID:

source: Log file:
fi: Lokitiedosto:

source: Warning!
fi: Varoitus!

source: Proceed with caution
fi: Etene varoen

source: Installing a new kernel can sometimes cause problems, especially if you're using proprietary drivers.
fi: Uuden kernelin asentaminen saattaa joskus aiheuttaa ongelmia, etenkin käytettäessä suljettuja ajureita.

source: These issues include:
fi: Nämä ongelmat sisältyvät:

source: - No wifi (or ethernet) - No video acceleration - Black screen on startup - Random system freeze
fi: - Ei wifi–yhteyttä (tai ethernet) - Ei videokiihdytystä - Musta näyttö käynnistettäessä - Satunnaiset järjestelmän jäätymiset

source: If you face any of these issues, don't panic:
fi: Jos kohtaat minkään näistä ongelmista, älä panikoi:

source: - Reboot. - Press and hold the Shift key to show the boot menu. - In the boot menu, select the line which starts with 'Advanced options'. - Select an older kernel. - After the computer boots with the older kernel, uninstall the new one.
fi: - Käynnistä uudelleen. - Paina ja pidä vaihtonäppäintä painettuna näyttääksesi käynnistysvalikon. - Käynnistysvalikosta valitse rivi, jossa lukee 'Advanced options'. - Valitse vanhempi kernel. - Kun tietokone on käynnistynyt vanhemmalla kernelillä, poista uusi.

source: Do not show this message again
fi: Älä näytä tätä viestiä uudelleen

source: Help
fi: Ohje

source: Continue
fi: Jatka

source: Kernel flavor:
fi: Kernelin tyyppi:

source: Perform Queued Actions...
fi: Suorita jonossa olevat toiminnot...

source: Remove Kernels...
fi: Poista kerneleitä...

source: Cancel
fi: Peruuta

source: Apply
fi: Toteuta

source: Please confirm the following actions:
fi: Vahvista seuraavat toiminnot:

source: Clear
fi: Tyhjennä

source: Select All
fi: Valitse kaikki

source: Install Updates
fi: Asenna päivitykset

source: A new version of the Update Manager is available
fi: Päivitysten hallinnasta on saatavilla uusi versio

source: Apply the Update
fi: Toteuta päivitys

source: Packages
fi: Paketit

source: Changelog
fi: Muutoshistoria

source: This tool provides your operating system with software and security updates.
fi: Tämä työkalu tarjoaa käyttöjärjestelmääsi ohjelmisto- ja turvapäivityksiä.

source: Security updates
fi: Tietoturvapäivitykset

source: Apply security updates to patch vulnerabilities and keep your computer safe.
fi: Toteuta tietoturvapäivitykset paikataksesi haavoittuvuuksia ja pitääksesi tietokoneesi turvassa.

source: Software updates
fi: Ohjelmistopäivitykset

source: Apply software updates to fix bugs in your computer.
fi: Toteuta ohjelmistopäivitykset korjataksesi virheitä tietokoneeltasi.

source: Set up system snapshots to protect yourself from mistakes and regressions. If anything breaks simply restore the last snapshot.
fi: Aseta palautuspisteet suojautuaksesi virheiltä ja regressioilta. Jos joki hajoaa, palautat vain edellisestä pisteestä.

source: Linux Mint recommends to set up automated system snapshots and to apply all available updates. This way, your computer is always secure and you can go back in time and recover from any potential regression.
fi: Linux Mint suosittelee automaattista palaustuspisteen asettamista ja saatavilla olevien päivitysten toteuttamista. Tällöin tietokoneesi on turvallinen ja voit palata ajassa takaisin ja palautua mistä tahansa potentiaalisesta regressiosta.

source: Packages listed here will never receive updates. Use this option to block updates that you know cause issues on your system.
fi: Tässä listattuja paketteja ei päivitetä ikinä. Käytä tätä valintaa päivityksille, joiden tiedät aiheuttavan ongelmia järjestelmässäsi.

source: It is recommended to add packages to the blacklist by right-clicking them in the updates listing.
fi: On suositeltavaa lisätä paketit mustalistalle napsauttamalla niitä päivitysluettelossa hiiren oikean puoleisella painikkeella.

source: Make sure your system snapshots are properly configured before using this option.
fi: Varmista ensin palautuspisteen asetusten olevan kunnossa ennen kuin käytät tätä valintaa.

source: Window
fi: Ikkuna

source: Selection
fi: Valinta

source: Select Security Updates
fi: Valitse tietoturvapäivitykset

source: Select Kernel Updates
fi: Valitse kernel päivitykset

source: A Flatpak runtime package
fi: Flatpak suorituspaketti

source: Checking for Flatpak updates
fi: Flatpak päivityksiä tarkistetaan

source: Flatpak application
fi: Flatpak sovellus

source: Flatpak runtime
fi: Flatpak suoritus

source: Error checking for flatpak updates: %s
fi: Virhe tarkistettaessa flatpak päivityksiä: %s

source: Website: %s
fi: Verkkosivu: %s

source: Total size: <
fi: Kokonaiskoko: <

source: Update Flatpaks automatically
fi: Flatpak päivitetään automaattisesti
