Repository: PikaOS-Linux/pkg-mintupdate
Catalog: mintupdate/po/mintupdate-*.po
Languages: fi

source: There are different types of updates
fi: Päivityksiä on erilaisia

source: The different types of updates
fi: Erilaiset päivitykset

source: There are different types of updates:
fi: Päivityksiä on erilaisia:

source: 'Software updates' are updates which fix bugs (or also sometimes which bring new features).
fi: ”Ohjelmistopäivitykset” korjaavat ohjelmavirheitä (ja joskus tuovat myös uusia ominaisuuksia).

source: 'Security updates' are updates which patch vulnerabilities.
fi: ”Tietoturvapäivitykset” paikkaavat haavoittuvuuksia.

source: 'Kernel updates' represent the installation of a newer kernel.
fi: "Kernel päivitykset" tarjoavat uudemman kernelin asentamisen.

source: Security is very important but also very technical. Vulnerabilities don't always affect your computer and can be quite difficult to understand. Most people don't understand them at all and their personal computers are rarely at risk. That said, a security breach can have dire consequences, so it is always recommended to take them seriously.
fi: Turvallisuus on erittäin tärkeää, mutta myös erittäin teknistä. Haavoittuvuudet eivät aina vaikuta tietokoneeseesi ja voivat olla hankalia ymmärtää. Useimmat ihmiset eivät ymmärrä niitä lainkaan ja heidän henkilökohtaiset tietokoneensa ovat harvoin vaarassa. Tästä huolimatta, turvallisuuspuutteilla voi olla vakavia seurauksia, joten on aina suositeltavaa ottaa ne vakavasti.

source: Software updates aren't as important. They bring bug fixes or improvements which are not related to security.
fi: Ohjelmistopäivitykset eivät ole yhtä tärkeitä. Ne tuovat virheenkorjauksia tai parannuksia jotka eivät liity turvallisuuteen.

source: In Linux Mint, kernel updates bring both security patches and bug fixes (and sometimes even new features), and they impact critical parts of the operating system. This makes kernel updates important from a security point of view, but also prone to regressions which can be hard to fix for novice users.
fi: Linux Mint kernel päivitykset tuovat korjauksia ohjelmointivirheisiin ja tietoturvaan (joskus jopa uusia ominaisuuksia) ja ne vaikuttavat käyttöjärjestelmän kriittisiin osiin. Tämä tekee kernel päivityksistä tärkeitä tietoturvan kannalta, mutta myös alttiita kriittisiin osiin, joita voi olla aloittelevan käyttäjän vaikea korjata.

source: When faced with a serious regression, restore the latest system snapshot.
fi: Palauta viimeisin järjestelmän palautuspiste, jos kohtaat vakavia ongelmia.

source: System snapshots
fi: Palautuspisteet

source: Timeshift, the system snapshot utility, is available in all versions of Linux Mint.
fi: Järjestelmän palautuspistetyökalu Timeshift on saatavilla kaikkiin Linux Mintin versioihin.

source: It can be used to create snapshots manually but also to automate system snapshots.
fi: Sitä voi käyttää järjestelmän palautuspisteiden luomiseen niin käsin kuin automaattisesti.

source: Linux Mint recommends the automation of daily and boot snapshots.
fi: Linux Mint suosittelee päivittäisten ja konetta käynnistettäessä luotavien palautuspisteiden automatisoimista.

source: If an update, a mistake, a bug or a malicious program breaks something on your computer, you can restore the operating system from any snapshot, thus cancelling the problem as if it never happened.
fi: Jos päivitys, virhe tai haittaohjelma rikkoo jotain tietokoneessa, käyttöjärjestelmän voi palauttaa mistä tahansa palautuspisteestä, jolloin ongelma katoaa kuin sitä ei olisi koskaan ollutkaan.

source: System snapshots only cover the operating system itself. They do not include or affect your personal data.
fi: Järjestelmän palautuspisteet sisältävät vain käyttöjärjestelmän. Ne eivät sisällä henkilökohtaisia tietojasi tai vaikuta niihin.

source: When an update breaks something, it's called a "regression".
fi: Kun päivitys rikkoo jotakin, tilannetta kutsutaan ”regressioksi”.

source: Software regressions
fi: Ohjelmistojen regressiot

source: Updates keep your computer safe, eliminate bugs and even sometimes add new features to your operating system.
fi: Päivitykset pitävät tietokoneesi turvallisena, tekevät virheenkorjauksia ja jopa saattavat joskus lisätä uusia ominaisuuksia käyttöjärjestelmääsi.

source: Unfortunately they also sometimes introduce new issues called 'regressions'.
fi: Joskus ne valitettavasti voivat saada aikaan ”regressioiksi” kutsuttuja uusia ongelmia.

source: Regressions are very common in the software industry. They're inherent to software development. Code changes can cause regressions. No matter how skilled developers are, they can't always predict every possible situation or test on every possible hardware specification.
fi: Regressiot ovat ohjelmistotuotannossa hyvin yleisiä. Ne kuuluvat ohjelmistokehitykseen luontaisesti. Koodimuutokset voivat aiheuttaa regressioita. Vaikka kehittäjät olisivat kuinka taitavia, he eivät kykene ennustamaan kaikkia mahdollisia tilanteita eivätkä tarkistamaan ohjelman toimivuutta kaikenlaisissa laitteistoissa.

source: When a regression happens, it breaks something which worked well before.
fi: Regressio rikkoo jotakin, mikä ennen sitä toimi aivan hyvin.

source: Sometimes it doesn't really matter, but sometimes it matters a lot.
fi: Joskus se ei vaikuta juuri lainkaan, mutta joskus se vaikuttaakin paljon.

source: It depends on what part of the operating system is affected and whether or not you're able to work around it or to fix it.
fi: Kaikki riippuu siitä, mitä käyttöjärjestelmän osaa regressio koskee ja voiko ongelman kiertää tai korjata.

source: Say, the PDF reader is no longer able to print. Well, it's annoying... but it's not as problematic as if your network connection stopped working or if you were suddenly unable to boot the computer or to login.
fi: Jos esimerkiksi PDF-katselimesta ei enää voi tulostaa, se on ärsyttävää… muttei läheskään yhtä harmillista kuin jos verkkoyhteys lakkaa toimimasta tai yhtäkkiä konetta ei voi käynnistää tai kirjautua siihen sisään.

source: In the latter case, it can be very problematic if you're not experienced with Linux and you don't know how to troubleshoot.
fi: Jälkimmäinen tapaus voi olla hyvin hankala, ellet ole kokenut Linux-käyttäjä ja tiedä, miten etsiä vikaa.

source: Updating from the command line
fi: Päivittäminen komentoriviltä

source: Using mintupdate-cli
fi: mintupdate-cli-komennon käyttö

source: The Update Manager provides a command line utility called "mintupdate-cli".
fi: Päivitystenhallinta tarjoaa komentorivityökalun nimeltä ”mintupdate-cli”.

source: If you are experienced with Linux, you can use this tool in your scripts or your cron jobs to automate the installation of software updates.
fi: Kokenut Linux-käyttäjä voi käyttää tätä työkalua skripteissään tai cron-töissään automatisoidakseen ohjelmistopäivitykset.

source: Listing updates
fi: Luetellaan päivityksiä

source: You can use the "list" command to list updates:
fi: Päivitysten luettelemiseksi voi käyttää komentoa ”list”:

source: You can use -s to only show the security updates.
fi: -s-valitsimella näytetään vain tietoturvapäivitykset.

source: You can use -k to only show the kernel updates.
fi: Valitsimella -k näytetään vain kernel päivitykset.

source: For instance, the following command lists all security updates:
fi: Esimerkiksi seuraava komento luettelee vain tietoturvapäivitykset:

source: Applying updates
fi: Toteutetaan päivityksiä

source: You can use the "upgrade" command to apply updates, using the same options.
fi: Toteuttaaksesi päivitykset samoin asetuksin voit käyttää komentoa ”upgrade”.

source: For instance, the following command applies kernel updates:
fi: Esimerkiksi seuraava komento toteuttaa kernel päivitykset:

source: Note the -r argument, which was added to refresh the cache.
fi: Huomaa -r-valitsin, joka lisättiin välimuistin virkistämiseksi.

source: For more information on mintupdate-cli and a complete list of arguments, type:
fi: Lisätietoa mintupdate-cli-komennoista ja -parametreista saa kirjoittamalla:

source: Kernels and kernel updates
fi: Kernel ja kernel päivitykset

source: Kernel updates
fi: Kernel päivitykset

source: The kernel is the central part of the operating system. Among other things, it is responsible for hardware support.
fi: Kernel on keskeinen osa käyttöjärjestelmää. Se on muun muassa vastuussa laitteistotuesta.

source: From a security point of view, it is important to apply kernel updates.
fi: Turvallisuuden näkökulmasta on tärkeää toteuttaa kernel päivitykset.

source: A kernel regression could however affect your ability to connect to the Internet, to start your desktop environment or even to boot the operating system.
fi: Kernel regressio voi kuitenkin vaikuttaa kykyysi muodostaa yhteys Internetiin, käynnistää työpöytää tai jopa koko käyttöjärjestelmää.

source: For this reason it is important to be cautious when applying kernel updates and to know how to revert them when something goes wrong.
fi: Tästä syystä on tärkeää olla varovainen kernel päivityksiä asentaessa ja tietää kuinka ne voidaan palauttaa, jos jokin menee pieleen.

source: Multiple kernels can be installed
fi: Useita kerneleitä voi asentaa

source: When you apply an update, you replace the old version of the software with the new version.
fi: Kun toteutat päivityksen, korvaat ohjelmiston vanhan version uudella versiolla.

source: Things are different when it comes to kernels. When you apply a "kernel update", you don't actually update the kernel, you install a new kernel alongside the existing one.
fi: Asiat ovat toisin, kun kyse on kernelistä. Kun asennat "kernel päivityksen", et varsinaisesti päivitä kerneliä, vaan asennat uuden kernelin olemassa olevan rinnalle.

source: Every time you apply a kernel update, you install a new kernel on the system, without removing the old ones.
fi: Joka kerta kun asennat kernel päivityksen, asennat järjestelmään uuden kernelin poistamatta vanhoja.

source: At boot time, the computer selects the most recent one.
fi: Käynnistettäessä tietokone valitsee tuoreimman.

source: Identifying the current kernel
fi: Nykyisen kernelin tunnistaminen

source: If you want to know which kernel you are currently using, open a terminal and type:
fi: Jos haluat tietää, mitä kerneliä käytät tällä hetkellä, avaa pääte ja kirjoita:

source: Installing and removing kernels
fi: Kernelin asentaminen ja poistaminen

source: You can install and remove kernels from the Update Manager.
fi: Voit asentaa ja poistaa kernelit "Päivitysten hallinnalla"

source: Select "View" -&gt; "Linux Kernels" in the menu.
fi: Valitse valikosta ”Näytä → Linux kernelit”.

source: You cannot remove the kernel you are currently using. To remove it, you need to reboot and select a different kernel to boot with.
fi: Et voi poistaa käytössä olevaa kerneliä. Poistaaksesi sen, sinun on käynnistettävä uudelleen ja valittava eri kernel.

source: Selecting a kernel
fi: Kernelin valinta

source: You can have multiple kernels installed, but you can only run one kernel at a time.
fi: Sinulla voi olla asennettuna useampi kernel, mutta voit käyttää vain yhtä kerrallaan.

source: When you boot the computer, the very first screen is called the Grub menu. This menu allows you to choose operating systems but you can also use it to select a kernel.
fi: Tietokonetta käynnistettäessä ensimmäistä näkymää kutsutaan Grub-valikoksi. Tässä valikossa voi valita paitsi käyttöjärjestelmän myös kernelin.

source: If you only have one operating system installed, your boot sequence might skip the Grub menu. To force the Grub menu to show, boot the computer and keep pressing the left <key>Shift</key> key.
fi: Jos vain yksi käyttöjärjestelmä on asennettu, käynnistys ohittaa Grubin valikon. Pakottaaksesi sen esiin pidä vasen <key>vaihto</key>näppäin pohjassa käynnistäessäsi tietokonetta.

source: To select a kernel, choose "Advanced options" in the Grub menu. You should see all the kernels currently installed. Select the one you want to use and your computer will boot with that one.
fi: Valitse kernel valitsemalla Grub-valikosta ”Advanced options”. Sen alla näkyvät kaikki asennetut kernelit. Valitse niistä se, jota haluat käyttää ja tietokoneesi käynnistyy sillä.

source: Checking the DKMS status
fi: Tarkastetaan DKMS:n tila

source: The kernel includes all open source drivers and these usually work very well. Proprietary drivers (NVIDIA, AMD, Broadcom...etc) are not included and they need to compile themselves against every kernel you install. This is done via a mechanism called DKMS.
fi: Kernel sisältää yleensä erittäin hyvin toimivat avoimen lähdekoodin ajurit. Suljetut ajurit (NVIDIA, AMD, Broadcom jne.) eivät ole mukana ja ne täytyy kääntää jokaiselle asennetulle kernelille erikseen. Tämä tehdään DKMS:ksi kutsutun mekanismin kautta.

source: If a proprietary driver isn't properly recompiled with DKMS for one of your kernels, it will not function correctly with that kernel.
fi: Jos suljettua ajuria ei ole käännetty oikein DKMS:n kanssa jollekin kernelille, se ei toimi oikein kyseisen kernelin kanssa.

source: After installing or removing a kernel, you can check your DKMS status, to make sure all proprietary drivers are properly installed for each of your kernels with the following command:
fi: Kernelin asentamisen tai poistamisen jälkeen voit tarkastaa DKMS:n tilan varmistaaksesi kaikkien suljettujen ajurien olevan oikein asennettuna jokaiselle kernelille seuraavalla komennolla:

source: New kernel series usually become available before proprietary drivers support them via DKMS. If you are using proprietary drivers, it is recommended to stick to kernel updates and not to install kernels from series which are newer than the series of the recommended kernels.
fi: Uusi kernel sarja tulee yleensä saataville ennen kuin suljetut ajurit tukevat niitä DKMS:n kautta. Jos käytät suljettuja ajureita on suositeltavaa pysyä kernel päivityksissä ja olla asentamatta sarjoja jotka ovat uudempia kuin suositellut kernelit.

source: Reverting a kernel update
fi: Kernel päivityksen peruminen

source: If something doesn't work with the latest kernel you installed (or the latest kernel update), reboot, select the kernel you were previously using, remove the new kernel and reboot again.
fi: Jos jokin ei toimi viimeisimmän asentamasi kernelin (tai uusimman kernelin päivityksen) kanssa, käynnistä uudelleen, valitse aiemmin käyttämäsi kernel, poista uusi kernel ja käynnistä uudelleen.

source: Update Manager
fi: Päivitysten hallinta

source: The Update Manager provides your operating system with software and security updates.
fi: Päivitysten hallinta tarjoaa käyttöjärjestelmääsi ohjelmisto- ja turvapäivityksiä.

source: Updates are important because they keep your computer safe, eliminate bugs and can even add new features to your operating system.
fi: Päivitykset ovat tärkeitä, koska ne pitävät tietokoneesi turvassa, korjaavat virheitä ja voivat jopa lisätä uusia ominaisuuksia käyttöjärjestelmääsi.

source: Unfortunately they also sometimes introduce new issues called 'regressions', which can break things which worked well before.
fi: Valitettavasti ne joskus tuovat myös mukanaan uusia pulmia joita kutsutaan "regressioiksi", ne voivat rikkoa asioita jotka toimivat aiemmin hyvin.

source: To keep your computer safe and in good working condition, it is recommended to apply all available updates and to set up system snapshots, so that you can restore your system in case something goes wrong.
fi: Pitääksesi tietokoneesi hyvässä kunnossa on suositeltavaa asentaa kaikki tarjolla olevat päivitykset ja tehdä palautuspisteet, jotta voit palauttaa järjestelmäsi jonkin mennessä pieleen.

source: Core concepts
fi: Ydinkonseptit

source: This section explains the core concepts related to software updates.
fi: Tämä osio selittää ohjelmistopäivityksiin liittyvät ydinkonseptit.

source: This section explains kernel updates.
fi: Tämä osio selittää kernel päivitykset.

source: Advanced techniques
fi: Kehittyneet tekniikat

source: This section explains advanced techniques.
fi: Tämä osio selittää kehittyneet tekniikat.

source: translator-credits
fi: Launchpad Contributions: Antti https://launchpad.net/~ballihici Ari Ervasti https://launchpad.net/~ari-ervasti87 Elias Ojala https://launchpad.net/~theel0ja Hermanni Saresma https://launchpad.net/~hermukka Jarppi https://launchpad.net/~jarppi Jiri Grönroos https://launchpad.net/~jiri-gronroos Jouni Vartiainen https://launchpad.net/~jovartia Juhani Numminen https://launchpad.net/~jsonic Kimmo Kujansuu https://launchpad.net/~mahtiankka Lasse Liehu https://launchpad.net/~lliehu Masa https://launchpad.net/~masa-diskotek Matias Fågel https://launchpad.net/~skywalker7777 Mustakari https://launchpad.net/~atvirtanen Niila Magga https://launchpad.net/~nippe87 Riku Viitanen https://launchpad.net/~riisseli4 Teuvo Hakala https://launchpad.net/~teuvo-hakala-gmail Tommi Nieminen https://launchpad.net/~legisign Veikko Mäkelä https://launchpad.net/~veikk0.ma Vili Johannes Aapro https://launchpad.net/~vili-aapro jjuujarv https://launchpad.net/~juujarvi matias Närekangas https://launchpad.net/~matiasudofinmint

source: The Linux kernel.
fi: Linux kernel.

source: The Linux Kernel is responsible for hardware and drivers support. Note that this update will not remove your existing kernel. You will still be able to boot with the current kernel by choosing the advanced options in your boot menu. Please be cautious though.. kernel regressions can affect your ability to connect to the Internet or to log in graphically. DKMS modules are compiled for the most recent kernels installed on your computer. If you are using proprietary drivers and you want to use an older kernel, you will need to remove the new one first.
fi: Linux kernel on vastuussa laitteiston ja ajureiden tuesta. Huomaathan ettei päivitys poista olemassa olevaa kerneliä. Voit silti käynnistää järjestelmän nykyisellä kernelillä valitsemalla käynnistysvalikosta lisävalinnat. Olethan kuitenkin varovainen: Kernelin regressiot voivat vaikuttaa verkkoyhteyksiin tai estää kirjautumisen graafiseen työpöytään. DKMS-moduulit käännetään viimeisimpiin tietokoneellesi asennettuihin kerneleihin. Jos käytät suljettuja ajureita ja haluat vanhemman kernelin, sinun täytyy poistaa ensin uudempi.

source: Remove
fi: Poista

source: Install
fi: Asenna

source: Queue Removal
fi: Jonopoisto

source: This kernel cannot be removed because it is currently in use.
fi: Tätä kerneliä ei voi poistaa, koska se on tällä hetkellä käytössä.

source: Queue Installation
fi: Jonoasennus

source: This kernel is not installable.
fi: Tämä kernel ei ole asennettavissa.

source: Are you sure you want to remove the %s kernel?
fi: Haluatko varmasti poistaa kernelin %s?

source: Are you sure you want to install the %s kernel?
fi: Haluatko varmasti asentaa kernelin %s?

source: Kernels
fi: Kernelit

source: Remove Kernels
fi: Poista kernelit

source: Perform Queued Actions
fi: Suorita jonossa olevat toiminnot

source: Active
fi: Aktiivinen

source: Installed
fi: Asennettu

source: Supported until
fi: Tuettu

source: Superseded
fi: Korvattu

source: End of Life
fi: Elinkaari loppu

source: Unsupported
fi: Ei tueta

source: You are currently using the following kernel:
fi: Käytät nyt seuraavaa kerneliä:

source: GB
fi: Gt

source: MB
fi: Mt

source: KB
fi: Kt

source: B
fi: t

source: Downloading changelog...
fi: Ladataan muutoshistoriaa...

source: No changelog available
fi: Muutoshistoriaa ei ole saatavilla

source: This upgrade will trigger additional changes
fi: Tämä päivitys aiheuttaa lisämuutoksia

source: The following packages will be removed:
fi: Seuraavat paketit poistetaan:

source: The following packages will be installed:
fi: Seuraavat paketit asennetaan:

source: Installing updates
fi: Asennetaan päivityksiä

source: Could not install the security updates
fi: Tietoturvapäivityksiä ei voitu asentaa

source: Updating Cinnamon Spices
fi: Cinnamon Spices päivitys

source: Restarting Cinnamon
fi: Käynnistä Cinnamon uudelleen

source: Reboot required
fi: Käynnistys uudelleen vaaditaan

source: You have installed updates that require a reboot to take effect, please reboot your system as soon as possible.
fi: Olet asentanut päivityksiä, joiden voimaantulo vaatii käynnistyksen. Käynnistä järjestelmä uudelleen mahdollisimman pian.

source: Checking for package updates
fi: Tarkistetaan pakettien päivityksiä

source: Checking for updates
fi: Tarkistetaan päivityksiä

source: Checking for Cinnamon spices
fi: Tarkistetaan Cinnamon Spices

source: Processing updates
fi: Käsitellään päivityksiä

source: Run 'apt update' in a terminal window to address this
fi: Suorita 'apt update' pääteikkunassa tämän ratkaisemiseksi

source: Your APT configuration is corrupt.
fi: APT-kokoonpano on vioittunut.

source: Do not install or update anything, it could break your operating system!
fi: Älä asenna tai päivitä mitään, se voi rikkoa käyttöjärjestelmäsi!

source: To switch to a different Linux Mint mirror and solve this problem, click OK.
fi: Vaihtaaksesi toiseen Linux Mint -peilipalvelimeen ja ratkaistaksesi tämän ongelman, napsauta OK.

source: APT error:
fi: APT virhe:

source: Please switch to another Linux Mint mirror
fi: Valitse toinen Linux Mint palvelin

source: Could not refresh the list of updates
fi: Ei voitu päivittää päivitettävien listaa

source: Kernel update
fi: Kernel päivitys

source: Security update
fi: Tietoturvapäivitys

source: Unstable software. Only apply this update to help developers beta-test new software.
fi: Epävakaat ohjelmistot. Valitse tämä päivitys auttaaksesi kehittäjiä beeta-testauksessa.

source: Software update
fi: Ohjelmistopäivitys

source: 3rd-party update
fi: Kolmannen–osapuolen päivitys

source: Cinnamon applet
fi: Cinnamon sovelma

source: Cinnamon desklet
fi: Cinnamon paneeli

source: Cinnamon theme
fi: Cinnamon teema

source: Cinnamon extension
fi: Cinnamon lisäosa

source: Updates are available
fi: Päivityksiä on saatavilla

source: %d security update
fi: %d päivitys tietoturva

source: %d software update
fi: %d päivitys ohjelmisto

source: Apply them to keep your operating system safe and up to date.
fi: Lisää ne pitääksesi käyttöjärjestelmän turvallisena ja ajan tasalla.

source: View updates
fi: Näytä päivitykset

source: Enable automatic updates
fi: Ota automaattiset päivitykset käyttöön

source: %(selected)d update selected (%(size)s)
fi: %(selected)d päivitys valittuna (%(size)s)

source: %d update available
fi: %d päivitys saatavilla

source: Your system is up to date
fi: Järjestelmä on ajan tasalla

source: Do you want to switch to a local mirror?
fi: Haluatko vaihtaa paikalliselle palvelimelle?

source: Local mirrors are usually faster than packages.linuxmint.com.
fi: Paikalliset peilipalvelimet ovat yleensä nopeampia, kuin packages.linuxmint.com.

source: Please switch to another mirror
fi: Valitse toinen palvelin

source: %s is unreachable.
fi: %s on tavoittamattomissa.

source: The last update on %(mirror)s was %(days)d day ago.
fi: Edellinen päivitys palvelimella %(mirror)s oli %(days)d päivä sitten.

source: Exit
fi: Poistu

source: Upgrade
fi: Päivitys

source: Name
fi: Nimi

source: Old Version
fi: Vanha versio

source: New Version
fi: Uusi versio

source: Size
fi: Koko

source: Type
fi: Tyyppi

source: Origin
fi: Alkuperä

source: Refresh
fi: Päivitä

source: Information
fi: Tietoja

source: Preferences
fi: Asetukset

source: Quit
fi: Lopeta

source: _File
fi: _Tiedosto

source: Close window
fi: Sulje ikkuna

source: _Edit
fi: _Muokkaa

source: System Snapshots
fi: Palautuspisteet

source: Software Sources
fi: Ohjelmistolähteet

source: Upgrade to %s
fi: Päivitä käyttöjärjestelmä versioon %s

source: _View
fi: _Näytä

source: History of Updates
fi: Päivityshistoria

source: Linux Kernels
fi: Linux kernelit

source: Visible Columns
fi: Näkyvät sarakkeet

source: Package
fi: Paketti
